app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Title has secret"], ["text", "Text has secret"], ["created_at", "2020-08-31 05:21:10.211969"], ["updated_at", "2020-08-31 05:21:10.211969"]]
---
  def create
    #render plain: params[:article].inspect
    #@article = Article.new(params[:article])
    #@article = Article.new(params.require(:article).permit(:title, :text))

    #@article.save
    #redirect_to @article
    @article = Article.new(article_params)

    if @article.save